# FlexDuct Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FlexDuct Class
Members See Also
---
A flex duct in the Autodesk Revit MEP product.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FlexDuct : MEPCurve
```

Visual Basic
---
```text
Public Class FlexDuct _
	Inherits MEPCurve
```

Visual C++
---
```text
public ref class FlexDuct : public MEPCurve
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB.Mechanical..::..FlexDuct
# See Also
FlexDuct Members
Autodesk.Revit.DB.Mechanical Namespace